benchmarks/1-social-network/workload_test/compose.log
Running 1m test @ http://10.0.0.5:31499/wrk2-api/post/compose
  4 threads and 8 connections
  Thread calibration: mean lat.: 5.031ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 5.165ms, rate sampling interval: 11ms
  Thread calibration: mean lat.: 4.813ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 5.282ms, rate sampling interval: 13ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency     4.87ms    1.34ms  12.38ms   96.34%
    Req/Sec     2.12     14.20   100.00     97.77%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    4.64ms
 75.000%    4.97ms
 90.000%    5.30ms
 99.000%   12.38ms
 99.900%   18.27ms
 99.990%   18.27ms
 99.999%   18.27ms
100.000%   18.27ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       3.557     0.000000            1         1.00
       4.163     0.100000           42         1.11
       4.323     0.200000           82         1.25
       4.463     0.300000          123         1.43
       4.551     0.400000          167         1.67
       4.643     0.500000          205         2.00
       4.711     0.550000          227         2.22
       4.751     0.600000          246         2.50
       4.819     0.650000          267         2.86
       4.883     0.700000          287         3.33
       4.971     0.750000          308         4.00
       5.007     0.775000          320         4.44
       5.043     0.800000          328         5.00
       5.091     0.825000          339         5.71
       5.127     0.850000          349         6.67
       5.211     0.875000          360         8.00
       5.271     0.887500          364         8.89
       5.303     0.900000          369        10.00
       5.391     0.912500          375        11.43
       5.431     0.925000          380        13.33
       5.499     0.937500          385        16.00
       5.507     0.943750          388        17.78
       5.571     0.950000          390        20.00
       5.799     0.956250          394        22.86
       5.903     0.962500          395        26.67
       7.219     0.968750          398        32.00
       7.315     0.971875          399        35.56
       7.595     0.975000          400        40.00
       8.623     0.978125          402        45.71
       9.087     0.981250          403        53.33
      10.663     0.984375          404        64.00
      11.031     0.985938          405        71.11
      11.031     0.987500          405        80.00
      12.375     0.989062          406        91.43
      13.079     0.990625          407       106.67
      13.079     0.992188          407       128.00
      13.455     0.992969          408       142.22
      13.455     0.993750          408       160.00
      13.455     0.994531          408       182.86
      16.591     0.995313          409       213.33
      16.591     0.996094          409       256.00
      16.591     0.996484          409       284.44
      16.591     0.996875          409       320.00
      16.591     0.997266          409       365.71
      18.271     0.997656          410       426.67
      18.271     1.000000          410          inf
#[Mean    =        4.867, StdDeviation   =        1.339]
#[Max     =       18.256, Total count    =          410]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  501 requests in 1.00m, 105.19KB read
  Socket errors: connect 0, read 0, write 0, timeout 27
Requests/sec:      8.35
Transfer/sec:      1.75KB