benchmarks/1-social-network/workload_test/compose.log
Running 1m test @ http://10.107.206.4:8080/wrk2-api/post/compose
  4 threads and 8 connections
  Thread calibration: mean lat.: 17.325ms, rate sampling interval: 36ms
  Thread calibration: mean lat.: 19.232ms, rate sampling interval: 68ms
  Thread calibration: mean lat.: 17.656ms, rate sampling interval: 42ms
  Thread calibration: mean lat.: 18.202ms, rate sampling interval: 42ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency    15.64ms    2.39ms  23.69ms   88.78%
    Req/Sec     1.99      6.72    28.00     91.31%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   15.24ms
 75.000%   16.21ms
 90.000%   17.55ms
 99.000%   23.69ms
 99.900%   45.60ms
 99.990%   45.60ms
 99.999%   45.60ms
100.000%   45.60ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

      12.647     0.000000            1         1.00
      13.775     0.100000           41         1.11
      14.239     0.200000           82         1.25
      14.583     0.300000          123         1.43
      14.903     0.400000          164         1.67
      15.239     0.500000          205         2.00
      15.375     0.550000          226         2.22
      15.575     0.600000          246         2.50
      15.791     0.650000          268         2.86
      15.991     0.700000          287         3.33
      16.207     0.750000          308         4.00
      16.463     0.775000          318         4.44
      16.591     0.800000          328         5.00
      16.815     0.825000          340         5.71
      17.039     0.850000          349         6.67
      17.327     0.875000          359         8.00
      17.423     0.887500          364         8.89
      17.551     0.900000          369        10.00
      17.759     0.912500          375        11.43
      18.095     0.925000          380        13.33
      18.239     0.937500          385        16.00
      18.351     0.943750          387        17.78
      18.495     0.950000          390        20.00
      18.639     0.956250          393        22.86
      19.071     0.962500          395        26.67
      19.487     0.968750          398        32.00
      19.727     0.971875          399        35.56
      19.967     0.975000          400        40.00
      21.135     0.978125          402        45.71
      21.631     0.981250          403        53.33
      22.047     0.984375          404        64.00
      22.415     0.985938          405        71.11
      22.415     0.987500          405        80.00
      23.695     0.989062          406        91.43
      25.119     0.990625          407       106.67
      25.119     0.992188          407       128.00
      26.847     0.992969          408       142.22
      26.847     0.993750          408       160.00
      26.847     0.994531          408       182.86
      30.255     0.995313          409       213.33
      30.255     0.996094          409       256.00
      30.255     0.996484          409       284.44
      30.255     0.996875          409       320.00
      30.255     0.997266          409       365.71
      45.599     0.997656          410       426.67
      45.599     1.000000          410          inf
#[Mean    =       15.637, StdDeviation   =        2.393]
#[Max     =       45.568, Total count    =          410]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  501 requests in 1.00m, 105.19KB read
  Socket errors: connect 0, read 0, write 0, timeout 27
Requests/sec:      8.35
Transfer/sec:      1.75KB