benchmarks/1-social-network/workload_test/home.log
Running 1m test @ http://10.107.206.4:8080/wrk2-api/home-timeline/read
  4 threads and 8 connections
  Thread calibration: mean lat.: 8.560ms, rate sampling interval: 35ms
  Thread calibration: mean lat.: 9.284ms, rate sampling interval: 34ms
  Thread calibration: mean lat.: 8.430ms, rate sampling interval: 33ms
  Thread calibration: mean lat.: 8.174ms, rate sampling interval: 35ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency     7.56ms    4.58ms  18.54ms   74.07%
    Req/Sec    14.76     20.77    85.00     90.85%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    4.39ms
 75.000%   12.26ms
 90.000%   14.03ms
 99.000%   18.54ms
 99.900%   24.62ms
 99.990%   27.61ms
 99.999%   27.61ms
100.000%   27.61ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       2.895     0.000000            1         1.00
       3.853     0.100000          298         1.11
       3.995     0.200000          593         1.25
       4.119     0.300000          891         1.43
       4.243     0.400000         1187         1.67
       4.387     0.500000         1475         2.00
       4.543     0.550000         1619         2.22
       6.307     0.600000         1766         2.50
       8.815     0.650000         1913         2.86
      11.391     0.700000         2062         3.33
      12.263     0.750000         2209         4.00
      12.559     0.775000         2282         4.44
      12.823     0.800000         2356         5.00
      13.127     0.825000         2429         5.71
      13.367     0.850000         2502         6.67
      13.655     0.875000         2578         8.00
      13.807     0.887500         2613         8.89
      14.031     0.900000         2651        10.00
      14.231     0.912500         2686        11.43
      14.495     0.925000         2723        13.33
      14.967     0.937500         2760        16.00
      15.319     0.943750         2778        17.78
      15.623     0.950000         2798        20.00
      15.999     0.956250         2815        22.86
      16.343     0.962500         2833        26.67
      16.879     0.968750         2853        32.00
      17.039     0.971875         2861        35.56
      17.215     0.975000         2870        40.00
      17.327     0.978125         2880        45.71
      17.695     0.981250         2888        53.33
      17.887     0.984375         2898        64.00
      18.095     0.985938         2903        71.11
      18.319     0.987500         2907        80.00
      18.511     0.989062         2911        91.43
      18.607     0.990625         2916       106.67
      19.407     0.992188         2921       128.00
      19.487     0.992969         2923       142.22
      19.551     0.993750         2925       160.00
      19.711     0.994531         2927       182.86
      20.287     0.995313         2930       213.33
      20.511     0.996094         2932       256.00
      21.215     0.996484         2933       284.44
      21.567     0.996875         2934       320.00
      21.615     0.997266         2935       365.71
      22.047     0.997656         2937       426.67
      22.895     0.998047         2938       512.00
      22.895     0.998242         2938       568.89
      24.303     0.998437         2939       640.00
      24.303     0.998633         2939       731.43
      24.623     0.998828         2940       853.33
      25.567     0.999023         2941      1024.00
      25.567     0.999121         2941      1137.78
      25.567     0.999219         2941      1280.00
      25.567     0.999316         2941      1462.86
      26.751     0.999414         2942      1706.67
      26.751     0.999512         2942      2048.00
      26.751     0.999561         2942      2275.56
      26.751     0.999609         2942      2560.00
      26.751     0.999658         2942      2925.71
      27.615     0.999707         2943      3413.33
      27.615     1.000000         2943          inf
#[Mean    =        7.559, StdDeviation   =        4.575]
#[Max     =       27.600, Total count    =         2943]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  3595 requests in 1.00m, 14.90MB read
Requests/sec:     59.90
Transfer/sec:    254.20KB